# Задайте список из n чисел последовательности
# (1 + (1 / n)) ^ n и выведите на экран их сумму.
# Пример:
# - Для n = 5: сумма = 11,55

n = int(input("Введите число N: "))
i = 0
x = 0
lst = []
while i <= n - 1:
    i += 1
    b = (1 + (1 / i)) ** i
    lst.append(b)
    x = x + b
print(f"Для n = {n}: сумма = {round(x, 2)}")
